In [1]:
import pandas as pd
import os
from sqlalchemy import create_engine
import time
import datetime

In [2]:
thor_data = 'Resources/THOR_WWII_DATA_CLEANED.csv'

In [4]:
thor_df = pd.read_csv(thor_data, encoding='latin-1')
thor_df.columns

Index(['WWII_ID', 'MSNDATE', 'THEATER', 'NAF', 'COUNTRY_FLYING_MISSION',
       'TGT_COUNTRY', 'TGT_LOCATION', 'LATITUDE', 'LONGITUDE', 'AIRCRAFT_NAME',
       'MAX', 'MIN'],
      dtype='object')

In [5]:
thor_df = thor_df[['MSNDATE', 'THEATER', 'NAF', 'COUNTRY_FLYING_MISSION',
       'TGT_COUNTRY', 'TGT_LOCATION', 'LATITUDE', 'LONGITUDE', 'AIRCRAFT_NAME',
       'MAX', 'MIN']].copy()
thor_df
thor_df = thor_df.sort_values(by='MSNDATE').copy()

In [6]:
thor_df = thor_df.dropna(how='any').copy()
thor_df = thor_df.rename_axis('ID').copy()
thor_df

,MSNDATE,THEATER,NAF,COUNTRY_FLYING_MISSION,TGT_COUNTRY,TGT_LOCATION,LATITUDE,LONGITUDE,AIRCRAFT_NAME,MAX,MIN
ID,,,,,,,,,,,
10706,1/1/41,ETO,RAF,GREAT BRITAIN,GERMANY,KIEL,54.330000,10.150000,HAMPDEN,88.0,78.0
10802,1/1/41,ETO,RAF,GREAT BRITAIN,GERMANY,BREMEN,53.080000,8.720000,WHITLEY,86.0,74.0
10803,1/1/41,ETO,RAF,GREAT BRITAIN,GERMANY,BREMEN,53.080000,8.720000,WHITLEY,85.0,72.0
10804,1/1/41,ETO,RAF,GREAT BRITAIN,GERMANY,BREMEN,53.080000,8.720000,WHITLEY,82.0,70.0
10805,1/1/41,ETO,RAF,GREAT BRITAIN,GERMANY,BREMEN,53.080000,8.720000,WHITLEY,85.0,68.0
...,...,...,...,...,...,...,...,...,...,...,...
106290,9/9/44,PTO,7 AF,USA,CAROLINE ISLANDS,PONAPE ISLAND,7.000000,158.416667,B25,98.0,84.0
106291,9/9/44,PTO,5 AF,USA,CELEBES ISLANDS,HAROEKOE,-3.600000,128.425082,P47,99.0,84.0
106292,9/9/44,PTO,7 AF,USA,CAROLINE ISLANDS,PONAPE ISLAND,7.000000,158.416667,B25,91.0,79.0
106293,9/9/44,PTO,5 AF,USA,CELEBES ISLANDS,LIANG,-3.516667,128.300000,P47,85.0,78.0
106342,9/9/44,ETO,RAF,GREAT BRITAIN,GERMANY,MUNCHEN GLADBACH,51.200000,6.420000,LANCASTER,79.0,56.0

In [7]:
# inserting df into db table
engine = create_engine('sqlite:///wwii.db', echo=False)
thor_df.to_sql('wwii_data', con=engine,if_exists='append')